package ru.itis.apphomework2.repository

import android.util.Log
import ru.itis.apphomework2.model.ListData
import ru.itis.apphomework2.model.ListDetailedData
import ru.itis.apphomework2.model.ListRecycleMainData

class ScreensDetailedContentRepo() {

    private var listInfo = listOf(
        ListDetailedData(
            id = 1,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1777765/992ac81f-2635-48b2-93fb-f82e01c712d3/300x450",
            headerText = "Закрытая школа",
            infoText = "Сериал рассказывает о жизни учеников и преподавателей элитной школы-интерната, расположенной в старинной усадьбе посреди мрачного, но живописного леса. В их замкнутом мире все переживания намного острее, чем в обычной школьной жизни. Несмотря на внешнее благополучие, ребята, оторванные от родного дома, очень ранимы и зачастую одиноки. По вечерам они рассказывают друг другу страшные легенды о лесе, глухой стеной окружающем их школу, говорят, будто в нем водятся странные существа и бесследно пропадают люди. Очень скоро ребята узнают, что правда гораздо страшнее легенд."
        ),
        ListDetailedData(
            id = 2,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1900788/fb35416f-3b0d-4b96-bc65-cf6923f9e329/300x450",
            headerText = "Во все тяжкие",
            infoText = "Школьный учитель химии Уолтер Уайт узнаёт, что болен раком лёгких. Учитывая сложное финансовое состояние дел семьи, а также перспективы, Уолтер решает заняться изготовлением метамфетамина. Для этого он привлекает своего бывшего ученика Джесси Пинкмана, когда-то исключённого из школы при активном содействии Уайта. Пинкман сам занимался варкой мета, но накануне, в ходе рейда УБН, он лишился подельника и лаборатории."
        ),
        ListDetailedData(
            id = 3,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1900788/35c6cb89-75e3-4efa-8d00-5bbf7175c066/300x450",
            headerText = "Друзья",
            infoText = "Шестеро друзей – Рейчел, Моника, Фиби, Джоуи, Чендлер и Росс – живут по соседству, вместе убивают время, делятся секретами и иногда очень сильно влюбляются."
        ),
        ListDetailedData(
            id = 4,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/10703859/478ff41a-bce8-41b7-80b2-cd7b712b6c27/300x450",
            headerText = "Молодёжка. Новая смена",
            infoText = "Команда Студенческой хоккейной лиги «Акулы Политеха» на грани расформирования. Но в вуз приходит Казанцев, который решает превратить «Акул» в лучшую команду лиги и тем самым повысить рейтинг института. Тренером клуба он видит в первую очередь бывшего игрока «Медведей» — Андрея Кисляка. Чтобы вывести «Акул» на следующий уровень, Кисляку придётся не только найти общий язык с новым поколением спортсменов, но и измениться самому."
        ),
        ListDetailedData(
            id = 5,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/eb3ac70c-d99d-471c-89f2-17d1b0978837/300x450",
            headerText = "Отчаянные домохозяйки",
            infoText = "В центре событий - четыре современные домохозяйки, которые живут в тихом пригороде и отчаянно ищут личного счастья. Сьюзан осталась одна после того, как муж променял её на секретаршу. Бывшая фотомодель, а ныне неверная жена, Габриель вышла замуж по расчёту, а потом поняла, что нуждается не в деньгах, а в настоящей любви, и завела роман с юным садовником. Бри пытается сохранить разваливающийся брак и найти общий язык с сыном-наркоманом и слишком рано повзрослевшей дочерью. Линнет поставила крест на блестящей карьере в крупной компании, чтобы посвятить всё свое время воспитанию детей. Внезапное самоубийство их подружки Мэри Элис Янг оставляет всех в недоумении и заставляет искать разгадку ее смерти..."
        ),
        ListDetailedData(
            id = 6,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/10893610/58239d8d-44d3-475e-ab3f-878679c64290/300x450",
            headerText = "Слово пацана. Кровь на асфальте",
            infoText = "Казань, начало 1989 года. Пока родители борются за выживание, подростки сбиваются в уличные банды и бьются за асфальт. Буквально, чтобы контролировать всё, что стоит на «их» земле или передвигается по ней. Среди всеобщей нищеты — чёткие правила жизни, поддержка и слово пацана, которое сильнее клятвы. 14-летний Андрей из интеллигентной семьи, он учится в музыкальной школе и живёт с мамой и маленькой сестрёнкой. Однажды парня назначают подтянуть по английскому сверстника Марата — гопника из местной группировки. Пообщавшись с нормальным пацаном и решив, что ему надоело быть чушпаном, Андрей вступает в банду."
        ),
        ListDetailedData(
            id = 7,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/10703959/296c6fed-9ac3-46d2-bf4c-a5fdfa0485e2/300x450",
            headerText = "Фишер",
            infoText = "1986 год. В районе правительственных дач на Рублевском шоссе одного за другим убивают подростков. Интеллигентный следователь Валерий Козырев, его дерзкий напарник из Ростова Евгений Боков и совсем молодая следователь Наталья Добровольская начинают расследование, даже не подозревая, как сильно оно изменит судьбу каждого из них. Единственный свидетель, способный опознать маньяка, — школьник Игорь, родители которого совсем не в восторге от контактов сына с милицией."
        ),
        ListDetailedData(
            id = 8,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1773646/37f88226-546b-4779-a074-c92202eb9374/300x450",
            headerText = "Кухня",
            infoText = "«Во все времена еда была рядом с людьми. Она искушает, вдохновляет, восхищает, отвращает. Но человек не может без еды, а значит тот, кто создает еду, может управлять миром...». Так думал Максим Лавров, когда шел осуществлять свою мечту – устраиваться поваром в один из самых дорогих ресторанов столицы. Мечта сбылась, вот только на деле все вышло не так вкусно. Шеф-повар ресторана Виктор Баринов – настоящая звезда гастрономического бомонда, знающая как угодить взыскательной публике. Оборотная сторона этого идеального образа – злоупотребление алкоголем, страсть к азартным играм и невыносимый характер. В гневе Баринов страшен, в загуле – неукротим..."
        ),
        ListDetailedData(
            id = 9,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/1485ac9a-7796-470b-a3eb-85dc725d4ec0/300x450",
            headerText = "Король и шут",
            infoText = "Горшок, Князь и Шут — герои панк-сказки, в которой студенты реставрационного училища стали одной из главных рок-групп страны, собрали «Юбилейный», покорили Москву, выступили как хедлайнеры на фестивале «Нашествие» и создали целую фэнтези-вселенную. Группа вошла в историю, а тексты их песен ожили в мире-фантазии, где Горшок и Князь отправляются спасать принцессу из плена колдуна."
        ),
        ListDetailedData(
            id = 10,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/4774061/47eebe97-9498-4ec9-8e52-3f6330424ede/300x450",
            headerText = "Мир! Дружба! Жвачка!",
            infoText = "1993 год. 14-летний Санька Рябинин живет обычной подростковой жизнью — ищет приключений, пытается защититься от районных хулиганов, не хочет ходить в музыкалку, не знает, как общаться с девчонками и с кого из взрослых брать пример. С одной стороны — честная, но бедная семья с мамой-продавщицей и папой-доцентом, с другой — опасный мир афганского ветерана дяди Алика. А тут еще и девочка Женя, знакомство с которой запускает череду необратимых событий, которые навсегда изменят жизнь Саньки, его семьи и друзей Вовки и Илюши. Сбегая от хулиганов, Санька угоняет машину местного криминального авторитета, и в один миг все меняется..."
        ),
        ListDetailedData(
            id = 11,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/4774061/e0afea1f-6e8e-4c9a-aa63-a31ebd3857d0/300x450",
            headerText = "Мажор",
            infoText = "Таких, как наш главный герой Игорь Соколовский, то есть детей высокопоставленных, богатых родителей, называют мажорами. Наш герой имеет юридическое образование, но ни одного дня не проработал. Безответственный прожигатель жизни. В один из загулов ночью он вступился за приятеля, подрался с полицейскими, выбил табельное оружие у офицера... В итоге отец лишает героя всего и отправляет работать в отделение полиции - то самое, в котором служат ночные полицейские. Его, мажора, там не ждут. Его презирают. Но именно там он начнет становиться мужчиной, встретит свою любовь и найдет убийцу мамы."
        ),
        ListDetailedData(
            id = 12,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/791d5250-96e7-47ef-a5ea-a791c6e4fe14/300x450",
            headerText = "Пищеблок",
            infoText = "Пока вся страна следит за Олимпиадой-80, в пионерском лагере «Буревестник» на Волге происходят странные события. Дети загадочно исчезают по ночам, а потом возвращаются — но совсем не такими, как прежде. Увлеченные летней свободой и друг другом вожатые не замечают, как в их отрядах оживают страшные пионерские легенды, а руководство лагеря делает вид, что все в порядке. Разбираться в тайнах «Буревестника» придется мальчику Валерке и вожатому Игорю. Для начала им предстоит понять, остался ли в лагере хоть кто-то, кому можно доверять."
        ),
        ListDetailedData(
            id = 13,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/10853012/e65a4287-7631-46b2-b79d-323bed05cf8b/300x450",
            headerText = "Ивановы-Ивановы",
            infoText = "Две семьи Ивановых узнают, что 16 лет назад их детей перепутали в роддоме. Как быть, если любимый сын на самом деле не родной, а твою кровиночку воспитывают чужие люди? Ещё и в роскоши, которая тебе даже не снилась. И как он примет своих новых, но уж больно бедных родственников?"
        ),
        ListDetailedData(
            id = 14,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/ce84bf0e-d302-4c64-8404-942f2f0e84c2/300x450",
            headerText = "Чернобыль: Зона отчуждения",
            infoText = "Пятеро молодых людей прыгают в старую «Волгу» и отправляются на поиски вора, часом ранее укравшего из квартиры родителей главного героя восемь миллионов рублей. Грабитель — обычный московский айтишник, — вместо того чтобы залечь на дно, тут же записывает видеоотчет, в котором сообщает, что финальная точка его путешествия — Чернобыльская АЭС и город Припять."
        ),
        ListDetailedData(
            id = 15,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/270df10e-2e72-4d8e-a49b-f84c751162a7/300x450",
            headerText = "Доктор Хаус",
            infoText = "Сериал рассказывает о команде врачей, которые должны правильно поставить диагноз пациенту и спасти его. Возглавляет команду доктор Грегори Хаус, который ходит с тростью после того, как его мышечный инфаркт в правой ноге слишком поздно правильно диагностировали. Как врач Хаус просто гений, но сам не отличается проникновенностью в общении с больными и с удовольствием избегает их, если только есть возможность. Он сам всё время проводит в борьбе с собственной болью, а трость в его руке только подчеркивает его жесткую, ядовитую манеру общения. Порой его поведение можно назвать почти бесчеловечным, и при этом он прекрасный врач, обладающий нетипичным умом и безупречным инстинктом, что снискало ему глубокое уважение..."
        ),
        ListDetailedData(
            id = 16,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1898899/5fb7d956-d5fb-4189-9ec9-1a051aaa7f41/300x450",
            headerText = "Триггер",
            infoText = "Психолог Артём Стрелецкий — сторонник шоковой терапии в лечении больных. Он считает, что единственный способ для человека решить свои проблемы — это понять себя и перестать себе врать. Если большинство психологов нянчатся с клиентами, по полгода выслушивают жалобы на жизнь, сочувствуют и получают при этом немалые деньги за цикл сеансов, то Артём постоянно провоцирует клиентов: оскорбляет их, смеется над ними, намеренно выталкивает из зоны комфорта. Практика Артема процветает, пока один из его пациентов не кончает жизнь самоубийством."
        ),
        ListDetailedData(
            id = 17,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1777765/dd78edfd-6a1f-486c-9a86-6acbca940418/300x450",
            headerText = "Игра престолов",
            infoText = "К концу подходит время благоденствия, и лето, длившееся почти десятилетие, угасает. Вокруг средоточия власти Семи королевств, Железного трона, зреет заговор, и в это непростое время король решает искать поддержки у друга юности Эддарда Старка. В мире, где все — от короля до наемника — рвутся к власти, плетут интриги и готовы вонзить нож в спину, есть место и благородству, состраданию и любви. Между тем никто не замечает пробуждение тьмы из легенд далеко на Севере — и лишь Стена защищает живых к югу от нее."
        ),
        ListDetailedData(
            id = 18,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/10592371/e2db42c4-4176-4a0f-b933-488412cd06a5/300x450",
            headerText = "Беспринципные",
            infoText = "Добро пожаловать на Патриаршие. Смешные и волнующие подробности личной жизни богатых москвичей, которые, как и все, попадают в неловкие ситуации. Правда, ситуации у них не самые обычные... Жена чувствует себя виноватой, познакомившись с любовницей мужа. Муж прикрывается выдуманной дочерью друга. А друг толкает помощника на измену, потому что так хочет жена. И это только начало. Одним словом, неприличные истории о приличных, казалось бы, людях."
        ),
        ListDetailedData(
            id = 19,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/4774061/ce90ef63-3c81-4aa7-95f0-f5bbe5123484/300x450",
            headerText = "Монастырь",
            infoText = "Мария — обаятельная тусовщица, которая живёт за чужой счёт. Однажды в Эмиратах она едет в ночной клуб вместе с женой миллиардера, вечеринка выходит из-под контроля, и теперь Марии грозит тюрьма, её преследуют опасные люди, а счета оказываются заблокированы. Приходится бежать в Россию, но и дома она не в безопасности — и девушка укрывается в стенах монастыря."
        ),
        ListDetailedData(
            id = 20,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1629390/f28c1ea2-47b0-49d5-b11c-9608744f0233/300x450",
            headerText = "Шерлок",
            infoText = "События разворачиваются в наши дни. Он прошел Афганистан, остался инвалидом. По возвращении в родные края встречается с загадочным, но своеобразным гениальным человеком. Тот в поиске соседа по квартире. Лондон, 2010 год. Происходят необъяснимые убийства. Скотланд-Ярд без понятия, за что хвататься. Существует лишь один человек, который в силах разрешить проблемы и найти ответы на сложные вопросы."
        ),
        ListDetailedData(
            id = 21,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/4483445/7d26d955-bc98-4731-8ec1-277359f9afa6/300x450",
            headerText = "Папины дочки. Новые",
            infoText = "Проклятие Васнецовых настигает уже повзрослевших дочерей семейного психотерапевта. В канун очередной годовщины свадьбы из дома сбегает Даша, оставив трудоголику Венику прощальное письмо, обручальное кольцо и четырёх дочерей. Теперь Вениамин, совсем как его тесть когда-то, вынужден стать для своих детей и папой, и мамой, и другом. А поможет ему в этом неунывающее семейство Васнецовых."
        ),
        ListDetailedData(
            id = 22,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/4486362/3266738a-2614-4ff1-a347-e95f7b90bddf/300x",
            headerText = "Трудные подростки",
            infoText = "Популярный футболист Антон Ковалёв, отсидев два года в тюрьме за пьяный дебош в кафе, выходит на свободу. Проступок перекрыл успешную карьеру Ковалёва, который ранее был капитаном сборной России. Репутация «сбитого летчика» не позволяет ему продолжить любимое дело и получить престижную работу. Некогда воспитывавший Антона глава центра трудных подростков Герман предлагает ему место в центре, чтобы подготовить непростых ребят к местной Олимпиаде. От безысходности Ковалев соглашается на предложение, но даже не представляет, насколько сложно будет найти общий язык с ребятами, и какое важное место они могут занять в его жизни."
        ),
        ListDetailedData(
            id = 23,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/1704946/35c2b0c2-742d-4fc4-be2e-aedad582f969/300x",
            headerText = "Чернобыль",
            infoText = "26 апреля 1988 года химик Валерий Легасов, надёжно спрятав шесть аудиокассет со своими воспоминаниями, вешается у себя в квартире.\n" +
                    "\n" +
                    "26 апреля 1986 года в 1:23:45 во время проведения эксперимента по безопасности на Чернобыльской АЭС происходит взрыв реактора и пожар. Поднятые по тревоге пожарные без спецзащиты прибывают на место аварии, не подозревая, что оказались в эпицентре крупнейшей в истории человечества техногенной катастрофы. Руководство ЧАЭС уверяет Кремль, что ситуация под контролем, и радиационный фон в норме, но по настоянию академика Легасова его вместе с зампредседателя Совета Министров Борисом Щербиной отправляют разобраться в происходящем на месте."
        ),
        ListDetailedData(
            id = 24,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/c2c45ca9-0270-4bb2-bb82-5de3f01effbc/300x450",
            headerText = "Сверхъестественное",
            infoText = "Сериал рассказывает о приключениях братьев Сэма и Дина Винчестеров, которые путешествуют по Соединённым Штатам на чёрном автомобиле Chevrolet Impala 1967 года, расследуют паранормальные явления, многие из которых основаны на американских городских легендах и фольклоре, и сражаются с порождениями зла, такими как демоны и призраки."
        ),
        ListDetailedData(
            id = 25,
            imageUrl = "https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/4639b97f-1ff6-4f63-b7f6-02ea1a14f553/300x450",
            headerText = "Очень странные дела",
            infoText = "1980-е годы, тихий провинциальный американский городок. Благоприятное течение местной жизни нарушает загадочное исчезновение подростка по имени Уилл. Выяснить обстоятельства дела полны решимости родные мальчика и местный шериф, также события затрагивают лучшего друга Уилла – Майка. Он начинает собственное расследование. Майк уверен, что близок к разгадке, и теперь ему предстоит оказаться в эпицентре ожесточенной битвы потусторонних сил."
        )
    )

    fun getInfo(id: Int) : ListDetailedData? {
        for (i in 0 until listInfo.size) {
            if (listInfo.get(i).id == id) {
                return listInfo.get(i)
            }
        }
        return null
    }

}